; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v2 - type_2 ?v6 - type_3)
 	      (pred_1 ?v4 - object ?v6 - type_3)
	      (pred_2 ?v2 - type_2 ?v7 - type_1)
	      (pred_4 ?v2 - type_2 ?v4 - object ?v7 - type_1))

   (:action op_1
       :parameters  (?v2 - type_2 ?v3 ?v5 - type_3)
       :precondition (and  (pred_3 ?v2 ?v3))
       :effect (and  (pred_3 ?v2 ?v5)
		     (not (pred_3 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_2 ?v8 - object ?v1 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v1) (pred_3 ?v2 ?v1) (pred_2 ?v2 ?v7))
       :effect (and (pred_4 ?v2 ?v8 ?v7)
		    (not (pred_1 ?v8 ?v1)) 
		    (not (pred_2 ?v2 ?v7))))

   (:action op_2
       :parameters (?v2 - type_2 ?v8 - object ?v1 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v2 ?v8 ?v7) (pred_3 ?v2 ?v1))
       :effect (and (pred_1 ?v8 ?v1)
		    (pred_2 ?v2 ?v7)
		    (not (pred_4 ?v2 ?v8 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_10 - type_2
obj_09 obj_07 obj_03 obj_02 - type_1
obj_11 obj_04 obj_12 obj_01 - type_3
obj_05 obj_06 obj_08 - object)
(:init
(pred_3 obj_13 obj_11)
(pred_2 obj_13 obj_09)
(pred_2 obj_13 obj_07)
(pred_3 obj_10 obj_04)
(pred_2 obj_10 obj_03)
(pred_2 obj_10 obj_02)
(pred_1 obj_05 obj_11)
(pred_1 obj_06 obj_11)
(pred_1 obj_08 obj_01)
)
(:goal
(and
(pred_1 obj_05 obj_01)
(pred_1 obj_06 obj_12)
(pred_1 obj_08 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_13 obj_12)))
)
)

; plan
1. (op_3 obj_13 obj_05 obj_11 obj_07)
   deleted: (pred_1 obj_05 obj_11) (pred_2 obj_13 obj_07)
   added: (pred_4 obj_13 obj_05 obj_07)
   goals met: 0 of 3
2. (op_3 obj_13 obj_06 obj_11 obj_09)
   deleted: (pred_1 obj_06 obj_11) (pred_2 obj_13 obj_09)
   added: (pred_4 obj_13 obj_06 obj_09)
   goals met: 0 of 3
3. (op_1 obj_13 obj_11 obj_01)
   deleted: (pred_3 obj_13 obj_11)
   added: (pred_3 obj_13 obj_01)
   goals met: 0 of 3
4. (op_2 obj_13 obj_05 obj_01 obj_07)
   deleted: (pred_4 obj_13 obj_05 obj_07)
   added: (pred_1 obj_05 obj_01) (pred_2 obj_13 obj_07)
   goals met: 1 of 3
5. (op_3 obj_13 obj_08 obj_01 obj_07)
   deleted: (pred_1 obj_08 obj_01) (pred_2 obj_13 obj_07)
   added: (pred_4 obj_13 obj_08 obj_07)
   goals met: 1 of 3
6. (op_1 obj_13 obj_01 obj_04)
   deleted: (pred_3 obj_13 obj_01)
   added: (pred_3 obj_13 obj_04)
   goals met: 1 of 3
7. (op_2 obj_13 obj_08 obj_04 obj_07)
   deleted: (pred_4 obj_13 obj_08 obj_07)
   added: (pred_1 obj_08 obj_04) (pred_2 obj_13 obj_07)
   goals met: 2 of 3
8. (op_2 obj_13 obj_06 obj_04 obj_09)
   deleted: (pred_4 obj_13 obj_06 obj_09)
   added: (pred_1 obj_06 obj_04) (pred_2 obj_13 obj_09)
   goals met: 2 of 3
9. (op_3 obj_10 obj_06 obj_04 obj_02)
   deleted: (pred_1 obj_06 obj_04) (pred_2 obj_10 obj_02)
   added: (pred_4 obj_10 obj_06 obj_02)
   goals met: 2 of 3
10. (op_1 obj_10 obj_04 obj_12)
   deleted: (pred_3 obj_10 obj_04)
   added: (pred_3 obj_10 obj_12)
   goals met: 2 of 3
11. (op_2 obj_10 obj_06 obj_12 obj_02)
   deleted: (pred_4 obj_10 obj_06 obj_02)
   added: (pred_1 obj_06 obj_12) (pred_2 obj_10 obj_02)
   goals met: 3 of 3
